app/controllers/songs_controller.rb

  def edit

    # if params[:author_id]
    #   author = Author.find_by(id: params[:author_id])
    #   if author.nil?
    #     redirect_to authors_path, alert: "Author not found."
    #   else
    #     @post = author.posts.find_by(id: params[:id])
    #     redirect_to author_posts_path(author), alert: "Post not found." if @post.nil?
    #   end
    # else
    #   @post = Post.find(params[:id])
    # end

    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]